In [1]:
import pandas as pd
import numpy as np

# Read the CSV file into a DataFrame
df = pd.read_csv("C:/Users/admin/Downloads/14.FDNY.csv",encoding='ISO-8859-1')
df

,FacilityName,FacilityAddress,Borough
0,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
...,...,...,...
214,Engine 162/Ladder 82/Battalion 23,256 Nelson Avenue,Staten Island
215,Engine 167/Ladder 87,345 Annadale Road,Staten Island
216,Engine 164/Ladder 84,1560 Drumgoole Road West,Staten Island
217,Engine 168/EMS Station 23,1100 Rossville Avenue,Staten Island
218,Engine 151/Ladder 76,7219 Amboy Road,Staten Island

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FacilityName     219 non-null    object
 1   FacilityAddress  219 non-null    object
 2   Borough          219 non-null    object
dtypes: object(3)
memory usage: 5.3+ KB

In [5]:
df.head()

,FacilityName,FacilityAddress,Borough
0,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan

In [6]:
df = pd.read_csv('C:/Users/admin/Downloads/14.FDNY.csv', skiprows=1)
df

,FacilityName,FacilityAddress,Borough
0,Engine 4/Ladder 15,42 South Street,Manhattan
1,Engine 10/Ladder 10,124 Liberty Street,Manhattan
2,Engine 6,49 Beekman Street,Manhattan
3,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
4,Ladder 8,14 North Moore Street,Manhattan
...,...,...,...
213,Engine 162/Ladder 82/Battalion 23,256 Nelson Avenue,Staten Island
214,Engine 167/Ladder 87,345 Annadale Road,Staten Island
215,Engine 164/Ladder 84,1560 Drumgoole Road West,Staten Island
216,Engine 168/EMS Station 23,1100 Rossville Avenue,Staten Island
217,Engine 151/Ladder 76,7219 Amboy Road,Staten Island

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 218 entries, 0 to 217
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FacilityName     218 non-null    object
 1   FacilityAddress  218 non-null    object
 2   Borough          218 non-null    object
dtypes: object(3)
memory usage: 5.2+ KB

In [8]:
df.describe()

              FacilityName  FacilityAddress   Borough
count                  218              218       218
unique                 218              218         5
top     Engine 4/Ladder 15  42 South Street  Brooklyn
freq                     1                1        66

In [9]:
df.columns

Index(['FacilityName', 'FacilityAddress', 'Borough'], dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 218 entries, 0 to 217
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FacilityName     218 non-null    object
 1   FacilityAddress  218 non-null    object
 2   Borough          218 non-null    object
dtypes: object(3)
memory usage: 5.2+ KB

In [11]:
df.index

RangeIndex(start=0, stop=218, step=1)

In [12]:
df.count()

FacilityName       218
FacilityAddress    218
Borough            218
dtype: int64

In [38]:
y=df.

FacilityName       218
FacilityAddress    218
Borough            218
dtype: int64

In [5]:
total_facilities = df.shape[0]
print("Total number of fire department facilities in New York City:", total_facilities)

Total number of fire department facilities in New York City: 219

In [3]:
attribute_counts = df.count()
print("\nNumber of records for each attribute:")
print(attribute_counts)

Number of records for each attribute:
FacilityName       219
FacilityAddress    219
Borough            219
dtype: int64

In [4]:
attribute_data_types = df.dtypes
print("\nData types of all three attributes:")
print(attribute_data_types)

Data types of all three attributes:
FacilityName       object
FacilityAddress    object
Borough            object
dtype: object

In [6]:
borough_counts = df['Borough'].value_counts()
print("Total number of fire department facilities in each Borough:")
print(borough_counts)

fdny_data_by_borough = df[df['Borough'] == 'FDNY']

Total number of fire department facilities in each Borough:
Brooklyn         66
Queens           50
Manhattan        48
Bronx            34
Staten Island    20
Borough           1
Name: Borough, dtype: int64

In [8]:
for borough in fdny_data_by_borough['Borough'].unique():
    borough_data = fdny_data_by_borough[fdny_data_by_borough['Borough'] == borough]
    print(f"\nFDNY information for {borough} Borough:")
    print(borough_data)

In [12]:
# Find the total number of fire department facilities in Manhattan
manhattan_facilities_count = df[df['Borough'] == 'MANHATTAN'].shape[0]
print("Total number of fire department facilities in Manhattan:", manhattan_facilities_count)

# Select FDNY information for Manhattan
fdny_manhattan_data = df[(df['Borough'] == 'MANHATTAN') & (df['FacilityName'].str.contains('FDNY'))]

Total number of fire department facilities in Manhattan: 0

In [13]:
# View FDNY information for Manhattan
print("\nFDNY information for Manhattan:")
print(fdny_manhattan_data)

FDNY information for Manhattan:
Empty DataFrame
Columns: [FacilityName, FacilityAddress, Borough]
Index: []